/*********************************************************************
 *
 *                           top51.c
 *
 *********************************************************************
 * 描    述: TOP51主板初始化函数
 * 开发平台: TOP51开发板+KEIL C51
 * 公    司: 爱晶电子			
 * 网    址: http://www.ajdz.net
 * 作者			日期			注释
 *~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * 王伟民		09/04/01		原始文件
 * 王伟民		09/10/20		v1.1
 ********************************************************************/

#include "stc.h"/*包含STC单片机头文件*/
#include "top51.h"/*包含TOP51开发板头文件*/

/*top51主板初始化函数*/
void top51_init(void)
{
	/* top51 引脚方向、输出初值定义 */
	//P0M1=0x00;/*0b00000000,设置P0为推挽输出*/
	//P0M0=0xff;/*0b11111111*/

	P0M1=0x00;/*0b00000000,设置P0为准双向口*/	
	P0M0=0x00;/*0b00000000*/
	
	//P1M1=0x4c;/*0b01001100,设置P1.0、P1.1为推挽输出*/
	//P1M0=0xb3;/*0b10110011*/

	P1M1=0x4c;/*0b01001100,设置P1.0、P1.1为准双向口*/	
	P1M0=0xb0;/*0b10110000*/
	
	P2M1=0x00;/*0b00000000*/
	P2M0=0xff;/*0b11111111*/
	
	P3M1=0x45;/*0b01000101*/
	P3M0=0x82;/*0b10000010*/

	P4SW=0x70;/*0bx111xxxx,将P4.4、P4.5、P4.6设置为I/O脚*/	
	
	//P4M1=0x00;/*0b00000000,设置P4.4、P4.5、P4.6为推挽输出*/	
	//P4M0=0x70;/*0b01110000*/

	P4M1=0x00;/*0b00000000,设置P4.4、P4.5、P4.6为准双向口*/	
	P4M0=0x00;/*0b00000000*/
	
	CS88=1;
	CS88=0;
	P0=0x00;
	P1=0x00;
	COL0=0; 
	COL1=0; 
	COL2=0; 
	COL3=0; 
	BZ=0;
	EN=0;/*让LCD1602数据口处于输入状态，相当于LCD1602使不能，让其释放数据总线*/
	CS=1;/*TF卡使不能*/
	RST=0;/*ds1302使不能*/

	CS88=1;
	P0=0xff;/*关闭点阵管，所有列均不显示*/
	CS88=0;/*输出被锁存*/
	
	P0=0;
	P1=0;/*关闭点阵管显示*/
}

